src/InformationRegisters/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/УчетныеЗаписиЭлектроннойПочты/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура снимает отметку "Основная" у других записей переданного пользователя
//
//	Параметры:
//		Пользователь   - Справочники.Пользователи;
//		ОсновнаяЗапись - Ключ или Менеджер той записи регистра, которой необходимо оставить отметку "Основная"
//
Процедура ПриУстановкеФлагаОсновная(Пользователь, ОсновнаяЗапись) Экспорт
	
	НаборЗаписей = РегистрыСведений.УчетныеЗаписиЭлектроннойПочты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	
	Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
		Если ЗаписьРегистра.УчетнаяЗапись = ОсновнаяЗапись.УчетнаяЗапись
		   И ЗаписьРегистра.Пользователь  = ОсновнаяЗапись.Пользователь Тогда
			
			ЗаписьРегистра.Основная = Истина;
			
		Иначе
			
			ЗаписьРегистра.Основная = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
